{
    "0": {
        "title": "Chipotle Veggie Burritos",
        "time": " 30 min",
        "servings": "4 servings",
        "ingredients": [
            "1 bunch cilantro, chopped",
            "1 clove garlic",
            "1/2 teaspoon chipotle chile powder, plus more to taste",
            "Kosher salt",
            "1 cup white rice",
            "1 15-ounce can black bean soup (preferably spicy)",
            "1 10-ounce package frozen chopped spinach, thawed and squeezed dry",
            "2 cups frozen corn (preferably fire-roasted), thawed",
            "1 large tomato, diced",
            "Juice of 1 lime",
            "4 burrito-size flour tortillas",
            "2 cups shredded pepper jack cheese (about 8 ounces)"
        ],
        "instructions": {
            "1": "Puree all but 3 tablespoons cilantro with 2 cups water, the garlic, chile powder and 3/4 teaspoon salt in a blender until smooth. Transfer to a medium saucepan along with the rice and bring to a boil. Reduce the heat to low; cover and cook until the liquid is absorbed, about 18 minutes. Uncover, stir and let cool 5 minutes.",
            "2": "Meanwhile, bring the black bean soup to a simmer in a small saucepan over medium-high heat and cook until the liquid is slightly reduced, about 3 minutes. Stir in the spinach and return to a simmer. Remove from the heat and cover to keep warm.",
            "3": "Toss the corn, tomato, lime juice, the reserved 3 tablespoons cilantro, 1/2 teaspoon salt, and chile powder to taste in a large bowl.",
            "4": "Warm the tortillas in a dry skillet or in the microwave. Divide the rice, bean mixture and cheese among the tortillas; top with some of the corn salsa. Fold up the bottoms of the tortillas, then fold in the sides and roll up. Serve with the remaining corn salsa."
        },
        "categories": [
            "Healthy",
            "Burrito",
            "Beans and Legumes",
            "Main Dish",
            "Vegetarian"
        ],
        "ingredient_tags": [
            "cilantro",
            "garlic",
            "chipotle chile powder",
            "Kosher salt",
            "white rice",
            "black bean soup",
            "frozen corn",
            "tomato",
            "lime",
            "flour tortillas",
            "pepper jack cheese"
        ]
    },
    "1": {
        "title": "Chipotle Meatball Burritos",
        "time": " 20 min",
        "servings": "4 servings",
        "ingredients": [
            "8 to 10 beef meatballs, quartered",
            "1/2 cup chipotle salsa, plus more for serving",
            "1 cup refried beans",
            "1 1/3 cups frozen brown rice",
            "4 10-inch flour tortillas",
            "1 1/2 cups shredded colby jack cheese (about 6 ounces)",
            "1/2 cup pico de gallo or salsa fresca",
            "1/2 avocado, sliced",
            "1 cup shredded iceberg lettuce",
            "Kosher salt and freshly ground pepper",
            "1 tablespoon vegetable oil"
        ],
        "instructions": {
            "1": "Combine the meatballs, chipotle salsa and 1/4 cup water in a medium saucepan and bring to a boil. Reduce the heat to medium and simmer, stirring occasionally, until the sauce thickens, about 5 minutes.",
            "2": "Meanwhile, warm the refried beans and rice separately as the labels direct. Spread the beans in a rectangle in the center of each tortilla and sprinkle with about half of the cheese. Divide the rice, meatball mixture, pico de gallo, avocado and lettuce among the tortillas and season with salt and pepper. Top with the remaining cheese. Fold in the sides of the tortillas, then roll up.",
            "3": "Brush the burritos all over with the vegetable oil and tightly wrap each in foil. Working in two batches, warm the burritos in a large skillet over medium heat until browned and crisp, 2 to 4 minutes per side. Serve with more chipotle salsa."
        },
        "categories": [
            "Burrito",
            "Meatballs",
            "Avocado",
            "Main Dish"
        ],
        "ingredient_tags": [
            "beef meatballs",
            "chipotle salsa",
            "beans",
            "frozen brown rice",
            "flour tortillas",
            "colby jack cheese",
            "pico de gallo",
            "avocado",
            "iceberg lettuce",
            "Kosher salt and pepper",
            "vegetable oil"
        ]
    }
}